<%@ page language="java" contentType="text/html; charset=UTF-8"
         pageEncoding="UTF-8" %>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<%@ taglib uri="http://java.sun.com/jsp/jstl/fmt" prefix="fmt" %>
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <title>青果巷子网站使用协议</title>
    <link rel="stylesheet" type="text/css" href="${pageContext.request.contextPath}/css/reset.css"/>
    <link rel="stylesheet" type="text/css" href="${pageContext.request.contextPath}/css/login.css"/>
    <script src="${pageContext.request.contextPath}/js/jquery.min.js"></script>
    <script type="text/javascript">
        var meta = document.createElement('meta');
        meta.name = "viewport";
        var rp = window.devicePixelRatio;
        var scale = 1 / rp.toFixed(1);
        meta.content = "width=device-width,initial-scale=" + scale + ",minimum-scale=" + scale + ",maximum-scale=" + scale + ",user-scalable=no";
        document.head.appendChild(meta);
    </script>
    <script type="text/javascript">
        var html = document.documentElement;
        var htmlWidth = html.getBoundingClientRect().width;
        html.style.fontSize = htmlWidth / 16 + "px";
    </script>

</head>
<body>
<div class="wrap">
    <h1>青果巷子网站使用协议</h1>
    <p>


        1. 特别提示</p>
    <p>
        1.1
        青果巷子同意按照本协议的规定及其不时发布的操作规则提供基于互联网以及移动网相关服务（以下称"网络服务"），为获得网络服务，服务使用人（以下称"用户"）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击"同意"按钮即表示用户完全接受本协议项下的全部条款。
    <p></p>
    1.2 用户注册成功后，青果巷子将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</p>
    <p>
        2. 服务内容
    <p></p>
    2.1 青果巷子网络服务的具体内容由青果巷子根据实际情况提供，例如文化资讯、青果公益、文人雅仕等。<p></p>
    2.2
    青果巷子提供的部分网络服务为收费的网络服务，用户使用收费网络服务需要向青果巷子支付一定的费用。对于收费的网络服务，青果巷子会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用该等收费网络服务。如用户拒绝支付相关费用，则青果巷子有权不向用户提供该等收费网络服务。
    <p></p>
    2.3 用户理解，青果巷子仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。</p>
    <p>
        3. 服务变更、中断或终止
    <p></p>
    3.1
    鉴于网络服务的特殊性，用户同意青果巷子有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，青果巷子无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，青果巷子应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费网络服务，如用户不愿意接受替代性的收费网络服务，就该用户已经向青果巷子支付的服务费，青果巷子应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给该用户。
    <p></p>
    3.2 用户理解，青果巷子需要定期或不定期地对提供网络服务的平台（如互联网网站）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，青果巷子无需为此承担任何责任，但青果巷子应尽可能事先进行通告。
    <p></p>
    3.3 如发生下列任何一种情形，青果巷子有权随时中断或终止向用户提供本协议项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：<p></p>
    3.3.1 用户提供的个人资料不真实；<p></p>
    3.3.2 用户违反本协议中规定的使用规则；<p></p>
    3.3.3 用户在使用收费网络服务时未按规定向青果巷子支付相应的服务费。<p></p>
    3.4 如用户注册的免费网络服务的帐号在任何连续360日内未实际使用，或者用户注册的收费网络服务的帐号在其订购的收费网络服务的服务期满之后连续360日内未实际使用，则青果巷子有权删除该帐号并停止为该用户提供相关的网络服务。
    </p><p>
    4. 使用规则
    <p></p>
    4.1 用户在申请使用青果巷子网络服务时，必须向青果巷子提供准确的个人资料，如个人资料有任何变动，必须及时更新。<p></p>
    4.2 用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知青果巷子。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，青果巷子不承担任何责任。<p></p>
    4.3 用户必须同意接受青果巷子通过电子邮件或其他方式向用户适量发送相关信息。<p></p>
    4.4 用户对于其创作并通过青果巷子网络服务上传到青果巷子网站上的内容依法享有版权及其他相关合法权利。<p></p>
    4.5 用户在使用青果巷子网络服务过程中，必须遵循以下原则：<p></p>
    4.5.1 遵守中国有关的法律和法规；<p></p>
    4.5.2 遵守所有与网络服务有关的网络协议、规定和程序；<p></p>
    4.5.3 不得为任何非法目的而使用网络服务系统；<p></p>
    4.5.4 不得利用青果巷子网络服务系统进行任何可能对互联网正常运转造成不利影响的行为；<p></p>
    4.5.5 不得利用青果巷子提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；<p></p>
    4.5.6 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；<p></p>
    4.5.7 不得利用青果巷子网络服务系统进行任何不利于视觉ME的行为；<p></p>
    4.5.8 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告青果巷子。<p></p>
    4.6 如用户在使用网络服务时违反任何上述规定，青果巷子或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。<p></p>
    4.7
    青果巷子针对某些特定的青果巷子网络服务的使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）作出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该等青果巷子网络服务，视为用户同意该等声明、通知、警示的内容。
    </p><p>
    5. 知识产权
    <p></p>
    5.1
    青果巷子提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有这些资料或资料的任何部分仅可作为私人和非商业用途而保存在某台计算机内。青果巷子不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。
    <p></p>
    5.2
    青果巷子为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse
    engineer）、反向编译（decompile）或反汇编（disassemble）。<p></p>
    </p><p>
    6. 隐私保护
    <p></p>
    6.1 保护用户隐私是青果巷子的一项基本政策，青果巷子保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在青果巷子的非公开内容，但下列情况除外：<p></p>
    6.1.1 事先获得用户的明确授权；<p></p>
    6.1.2 根据有关的法律法规要求；<p></p>
    6.1.3 按照相关政府主管部门的要求；<p></p>
    6.1.4 为维护社会公众的利益；<p></p>
    6.1.5 为维护青果巷子的合法权益。<p></p>
    6.2 青果巷子可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与青果巷子同等的保护用户隐私的责任，则青果巷子有权将用户的注册资料等提供给该第三方。<p></p>
    6.3 在不透露单个用户隐私资料的前提下，青果巷子有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。<p></p>
    </p><p>
    7. 免责声明
    <p></p>
    7.1 用户明确同意其使用青果巷子网络服务所存在的风险将完全由其自己承担；因其使用青果巷子网络服务而产生的一切后果也由其自己承担，青果巷子对用户不承担任何责任。<p></p>
    7.2 青果巷子不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。<p></p>
    7.3 青果巷子不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由青果巷子实际控制的任何网页上的内容，青果巷子不承担任何责任。<p></p>
    7.4 对于因不可抗力或青果巷子不能控制的原因造成的网络服务中断或其它缺陷，青果巷子不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。<p></p>
    7.5 用户同意，对于青果巷子向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，青果巷子无需承担任何责任：<p></p>
    7.5.1 青果巷子向用户免费提供的各项网络服务；<p></p>
    7.5.2 青果巷子向用户赠送的任何产品或者服务；<p></p>
    7.5.3 青果巷子向收费网络服务用户附赠的各种产品或者服务。<p></p>
    </p><p>
    8. 违约赔偿
    <p></p>
    8.1 如因青果巷子违反有关法律、法规或本协议项下的任何条款而给用户造成损失，青果巷子同意承担由此造成的损害赔偿责任。<p></p>
    8.2 用户同意保障和维护青果巷子及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给青果巷子或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
    </p><p>
    9. 协议修改
    <p></p>
    9.1 青果巷子有权随时修改本协议的任何条款，一旦本协议的内容发生变动，青果巷子将会通过适当方式向用户提示修改内容。<p></p>
    9.2 如果不同意青果巷子对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受青果巷子对本协议相关条款所做的修改。<p></p>
    </p><p>
    10. 通知送达
    <p></p>
    10.1 本协议项下青果巷子对于用户所有的通知均可通过网页公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。<p></p>
    10.2 用户对于青果巷子的通知应当通过青果巷子对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。<p></p>
    </p><p>
    11. 法律管辖
    <p></p>
    11.1 本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。<p></p>
    11.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向青果巷子所在地的人民法院提起诉讼。
    </p><p>
    12. 其他规定
    <p></p>
    12.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。<p></p>
    12.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。<p></p>
    12.3 本协议中的标题仅为方便而设，在解释本协议时应被忽略。</p>
</div>
</body>
</html>
